Project/Toir/src/InformationRegisters/торо_ОграниченияНаХарактеристикиОборудования/торо_ОграниченияНаХарактеристикиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОграниченияНаХарактеристикиОборудования</name>
  <resources>
    <name>гкс_Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФункциональноеМесто</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Иерархия</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ограничение</name>
    <type>
      <types>CatalogRef.торо_ОграниченияНаХарактеристикиОбрудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИерархическиеСтруктурыОР</name>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОбъектыДляПроверкиТребованийФМ/торо_ОбъектыДляПроверкиТребованийФМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОбъектыДляПроверкиТребованийФМ</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ДокументыДляПроверкиТребованийФМ/торо_ДокументыДляПроверкиТребованийФМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ДокументыДляПроверкиТребованийФМ</name>
  <dimensions>
    <name>ПроверяемыйДокумент</name>
    <type>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ТекущиеФМОР/гкс_ТекущиеФМОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеФМОР</name>
  <resources>
    <name>ФМ</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>ТМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <resources>
    <name>ТМФМ</name>
    <type>
      <types>CatalogRef.гкс_ТехническиеМеста</types>
    </type>
  </resources>
  <dimensions>
    <name>ОР</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыОбъектовRCM</name>
  <enumValues>
    <name>Объект</name>
  </enumValues>
  <enumValues>
    <name>ФункциональноеМесто</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыСравнения/торо_ВидыСравнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыСравнения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервале</name>
  </enumValues>
  <enumValues>
    <name>НеВИнтервале</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_IDРезультатаОбходаАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееЗначение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКритическийМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДопустимыйМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДопустимыйМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКритическийМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/CommonModules/гкс_ПроверкаФункциональныхМест/Module.bsl
// Проверяет какие объекты ремонта на соответствие требованиям функционального места
//
// Параметры:
//  МассивОР - Массив
//  ФМ - СправочникСсылка.торо_ОбъектыРемонта
//  ТекстЗапроса - Строка
//  МВТ - МенеджерВременныхТаблиц
//  Иерархия - СправочникСсылка.торо_СтруктурыОР
Функция ПроверитьОграниченияМассиваОР(МассивОР = Неопределено, 
							ФункциональноеМесто = Неопределено, ТекстЗапроса = "",
							МВТ = Неопределено, Иерархия = Неопределено)Экспорт
			
	СтрРезультат = Новый Структура("Подходят,НеПодходят",Новый Массив(),Новый Массив());
	
	
	Запрос = Новый Запрос;
	Если не МВТ = Неопределено Тогда 
		Запрос.МенеджерВременныхТаблиц = МВТ;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
		Запрос.Текст = ТекстЗапроса;
	Иначе
		Если ЗначениеЗаполнено(ФункциональноеМесто) Тогда 
			Если ТипЗнч(ФункциональноеМесто) = Тип("Массив") Тогда 
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	торо_ОбъектыРемонта.Ссылка КАК ФМ,
					|	торо_ОбъектыРемонта.ТиповойОР КАК ТОР
					|ПОМЕСТИТЬ ФМТОР
					|ИЗ
					|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
					|ГДЕ
					|	торо_ОбъектыРемонта.Ссылка В (&Ссылка)"+"
					|;
					|
					|";
			Иначе
				Запрос.Текст = 
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	торо_ОбъектыРемонта.Ссылка КАК ФМ,
					|	торо_ОбъектыРемонта.ТиповойОР КАК ТОР
					|ПОМЕСТИТЬ ФМТОР
					|ИЗ
					|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
					|ГДЕ
					|	торо_ОбъектыРемонта.Ссылка = &Ссылка"+"
					|;
					|
					|";
			КонецЕсли;
		Иначе
			Запрос.Текст = 
					"ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	торо_ОбъектыРемонта.Ссылка КАК ФМ,
					|	торо_ОбъектыРемонта.ТиповойОР КАК ТОР
					|ПОМЕСТИТЬ ФМТОР
					|ИЗ
					|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
					|ГДЕ
					|	торо_ОбъектыРемонта.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)"+"
					|;
					|
					|";
		КонецЕсли;
			Запрос.Текст =  Запрос.Текст +"ВЫБРАТЬ
			                              |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
			                              |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия,
			                              |	ФМТОР.ФМ КАК ФМ,
			                              |	ЛОЖЬ КАК гкс_Удален
			                              |ПОМЕСТИТЬ ВсеОграничения
			                              |ИЗ
			                              |	ФМТОР КАК ФМТОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
			                              |		ПО ФМТОР.ТОР = торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка
			                              |
			                              |ОБЪЕДИНИТЬ ВСЕ
			                              |
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	торо_ОграниченияНаХарактеристикиОборудования.Ограничение,
			                              |	торо_ОграниченияНаХарактеристикиОборудования.Иерархия,
			                              |	ФМТОР.ФМ,
			                              |	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален
			                              |ИЗ
			                              |	ФМТОР КАК ФМТОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
			                              |		ПО ФМТОР.ФМ = торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ВсеОграничения.Ограничение КАК Ограничение,
			                              |	ВсеОграничения.Иерархия КАК Иерархия,
			                              |	ВсеОграничения.ФМ КАК ФМ,
			                              |	МАКСИМУМ(ВсеОграничения.гкс_Удален) КАК гкс_Удален
			                              |ПОМЕСТИТЬ СхлопнутыеОграничения
			                              |ИЗ
			                              |	ВсеОграничения КАК ВсеОграничения
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ВсеОграничения.Ограничение,
			                              |	ВсеОграничения.Иерархия,
			                              |	ВсеОграничения.ФМ
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	РегистрОР.ОбъектИерархии КАК ОР,
			                              |	РегистрОР.СтруктураИерархии КАК СтруктураИерархии,
			                              |	РегистрОР.ОбъектИерархии.ТиповойОР КАК ТОР,
			                              |	РегистрОР.РодительИерархии КАК ФМ
			                              |ПОМЕСТИТЬ ВсеОР
			                              |ИЗ
			                              |	ФМТОР КАК ФМТОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
			                              |		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
			                              |			И (&ОтборОР)
			                              |			И (РегистрОР.СтруктураИерархии = &Иерархия)
			                              |
			                              |ОБЪЕДИНИТЬ ВСЕ
			                              |
			                              |ВЫБРАТЬ
			                              |	РегистрОР.ОбъектИерархии,
			                              |	РегистрОР.СтруктураИерархии,
			                              |	РегистрОР.ОбъектИерархии.ТиповойОР,
			                              |	РегистрОР.РодительИерархии
			                              |ИЗ
			                              |	ФМТОР КАК ФМТОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, ) КАК РегистрОР
			                              |		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
			                              |			И (РегистрОР.Удален = ЛОЖЬ)
			                              |			И (&ОтборОР)
			                              |			И (РегистрОР.СтруктураИерархии = &Иерархия)
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	СхлопнутыеОграничения.Ограничение КАК Ограничение,
			                              |	ВсеОР.СтруктураИерархии КАК СтруктураИерархии,
			                              |	ВсеОР.ОР КАК ОР,
			                              |	СхлопнутыеОграничения.ФМ КАК ФМ
			                              |ПОМЕСТИТЬ ОграниченияОР
			                              |ИЗ
			                              |	СхлопнутыеОграничения КАК СхлопнутыеОграничения
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ВсеОР
			                              |		ПО (СхлопнутыеОграничения.Иерархия = ВсеОР.СтруктураИерархии
			                              |				ИЛИ СхлопнутыеОграничения.Иерархия = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка))
			                              |			И (СхлопнутыеОграничения.гкс_Удален = ЛОЖЬ)
			                              |			И (ВсеОР.ФМ = СхлопнутыеОграничения.ФМ)
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
			                              |	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Показатель КАК Показатель,
			                              |	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Значение КАК Значение,
			                              |	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ДатаКонтроля КАК ДатаКонтроля
			                              |ПОМЕСТИТЬ ПоказателиОР
			                              |ИЗ
			                              |	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(
			                              |			,
			                              |			ОбъектРемонта В
			                              |				(ВЫБРАТЬ
			                              |					ТЧ.ОР
			                              |				ИЗ
			                              |					ВсеОР КАК ТЧ)) КАК торо_ЗначенияКонтролируемыхПоказателейСрезПоследних
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
			                              |	ПоказателиОР.Показатель КАК Показатель,
			                              |	МАКСИМУМ(ПоказателиОР.ДатаКонтроля) КАК ДатаКонтроля
			                              |ПОМЕСТИТЬ ПоказателиОРМаксимум
			                              |ИЗ
			                              |	ПоказателиОР КАК ПоказателиОР
			                              |
			                              |СГРУППИРОВАТЬ ПО
			                              |	ПоказателиОР.ОбъектРемонта,
			                              |	ПоказателиОР.Показатель
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
			                              |	ПоказателиОР.Показатель КАК Показатель,
			                              |	ПоказателиОР.Значение КАК Значение
			                              |ПОМЕСТИТЬ ПоказателиОРСрез
			                              |ИЗ
			                              |	ПоказателиОР КАК ПоказателиОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРМаксимум КАК ПоказателиОРМаксимум
			                              |		ПО ПоказателиОР.ОбъектРемонта = ПоказателиОРМаксимум.ОбъектРемонта
			                              |			И ПоказателиОР.Показатель = ПоказателиОРМаксимум.Показатель
			                              |			И ПоказателиОР.ДатаКонтроля = ПоказателиОРМаксимум.ДатаКонтроля
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	ВсеОР.ТОР КАК ТОР,
			                              |	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
			                              |	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение,
			                              |	ВсеОР.ОР КАК ОР
			                              |ПОМЕСТИТЬ РеквизитыТОР
			                              |ИЗ
			                              |	ВсеОР КАК ВсеОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
			                              |		ПО ВсеОР.ТОР = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение,
			                              |	ОграниченияОР.ОР КАК ОР,
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика
			                              |ПОМЕСТИТЬ ОграниченияРеквизиты1
			                              |ИЗ
			                              |	ОграниченияОР КАК ОграниченияОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
			                              |		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
			                              |	ОграниченияРеквизиты.Значение КАК Значение,
			                              |	ОграниченияРеквизиты.ОР КАК ОР,
			                              |	ЕСТЬNULL(торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Характеристика, ОграниченияРеквизиты.Характеристика) КАК Характеристика
			                              |ПОМЕСТИТЬ ОграниченияРеквизиты
			                              |ИЗ
			                              |	ОграниченияРеквизиты1 КАК ОграниченияРеквизиты
			                              |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.СписокХарактеристик КАК торо_ГруппыХарактеристикОборудованияСписокХарактеристик
			                              |		ПО ОграниченияРеквизиты.Характеристика = торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                              |	ОграниченияОР.ОР КАК ОР,
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика КАК Характеристика,
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения КАК ВидСравнения,
			                              |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение КАК Значение
			                              |ПОМЕСТИТЬ ОграниченияПоказатели
			                              |ИЗ
			                              |	ОграниченияОР КАК ОграниченияОР
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
			                              |		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
			                              |;
			                              |
			                              |////////////////////////////////////////////////////////////////////////////////
			                              |ВЫБРАТЬ
			                              |	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
			                              |	ОграниченияРеквизиты.Значение КАК План,
			                              |	ОграниченияРеквизиты.ОР КАК ОР,
			                              |	РеквизитыТОР.Значение КАК Факт,
			                              |	РеквизитыТОР.Свойство КАК Свойство
			                              |ИЗ
			                              |	ОграниченияРеквизиты КАК ОграниченияРеквизиты
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыТОР КАК РеквизитыТОР
			                              |		ПО ОграниченияРеквизиты.ОР = РеквизитыТОР.ОР
			                              |			И ОграниченияРеквизиты.Характеристика = РеквизитыТОР.Свойство
			                              |
			                              |ОБЪЕДИНИТЬ ВСЕ
			                              |
			                              |ВЫБРАТЬ
			                              |	ОграниченияПоказатели.ВидСравнения,
			                              |	ОграниченияПоказатели.Значение,
			                              |	ОграниченияПоказатели.ОР,
			                              |	ПоказателиОР.Значение,
			                              |	ПоказателиОР.Показатель
			                              |ИЗ
			                              |	ОграниченияПоказатели КАК ОграниченияПоказатели
			                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРСрез КАК ПоказателиОР
			                              |		ПО ОграниченияПоказатели.Характеристика = ПоказателиОР.Показатель
			                              |			И ОграниченияПоказатели.ОР = ПоказателиОР.ОбъектРемонта
			                              |ИТОГИ ПО
			                              |	ОР";
		КонецЕсли;
		
	Если ЗначениеЗаполнено(ФункциональноеМесто) Тогда 
		Запрос.УстановитьПараметр("Ссылка", ФункциональноеМесто);
	КонецЕсли;
	Если Не МассивОР = Неопределено Тогда 
		Запрос.УстановитьПараметр("МассивОР", МассивОР);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ОтборОР","РегистрОР.ОбъектИерархии В (&МассивОР)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"И (&ОтборОР)","");
		Запрос.УстановитьПараметр("ОтборОР", Истина);
	КонецЕсли;
	Если Иерархия = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрОР.СтруктураИерархии = &Иерархия","Истина");
	Иначе
		Запрос.УстановитьПараметр("Иерархия", Иерархия);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		НеПодходит = Ложь;
		ТекстТребований = "";
		Выборка1 = Выборка.Выбрать();
		Пока Выборка1.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка1.Свойство)=Ложь Тогда 
				Продолжить;
			КонецЕсли;
			ТипФакта = ТипЗнч(Выборка1.Факт);
			ТипПлана = ТипЗнч(Выборка1.План);
			Если Не ТипФакта = ТипПлана Тогда 
				Продолжить;
			КонецЕсли;
			Если Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Равно Тогда 
				Если Не Выборка1.План = Выборка1.Факт Тогда 
					НеПодходит = Истина;
					ТекстТребований = ТекстТребований + Выборка1.Свойство + " Равно " + Выборка1.План +"(сейчас "+Выборка1.Факт+")";
					//Прервать;
				КонецЕсли;
			ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.НеРавно Тогда 
				Если Выборка1.План = Выборка1.Факт Тогда 
					НеПодходит = Истина;
					ТекстТребований = ТекстТребований + Выборка1.Свойство + " Не равно " + Выборка1.План+"(сейчас "+Выборка1.Факт+")";
					//Прервать;
				КонецЕсли;
			ИначеЕсли ТипФакта = Тип("Число") ИЛИ ТипФакта = Тип("Дата") Тогда 
				Если Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Больше Тогда 
					Если Выборка1.План >= Выборка1.Факт Тогда 
						НеПодходит = Истина;
						ТекстТребований = ТекстТребований + Выборка1.Свойство + " Больше " + Выборка1.План+"(сейчас "+Выборка1.Факт+")";
						//Прервать;
					КонецЕсли;
				ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.БольшеИлиРавно Тогда 
					Если Выборка1.План > Выборка1.Факт Тогда 
						НеПодходит = Истина;
						ТекстТребований = ТекстТребований + Выборка1.Свойство + " Больше или равно " + Выборка1.План+"(сейчас "+Выборка1.Факт+")";
						//Прервать;
					КонецЕсли;
				ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Меньше Тогда 
					Если Выборка1.План <= Выборка1.Факт Тогда 
						НеПодходит = Истина;
						ТекстТребований = ТекстТребований + Выборка1.Свойство + " Меньше " + Выборка1.План+"(сейчас "+Выборка1.Факт+")";
						//Прервать;
					КонецЕсли;
				ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.МеньшеИлиРавно Тогда 
					Если Выборка1.План < Выборка1.Факт Тогда 
						НеПодходит = Истина;
						ТекстТребований = ТекстТребований + Выборка1.Свойство + " Меньше или равно " + Выборка1.План+"(сейчас "+Выборка1.Факт+")";
						//Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если НеПодходит Тогда 
			ВременнаяСтруктура = Новый Структура("Ссылка, ТекстТребований, ФМ, Подразделение");
			ЗаполнитьЗначенияСвойств(ВременнаяСтруктура,Выборка);
			ВременнаяСтруктура.ТекстТребований = ТекстТребований;
			ВременнаяСтруктура.Ссылка = Выборка.ОР;
			СтрРезультат.НеПодходят.Добавить(ВременнаяСтруктура);
			
		Иначе
			СтрРезультат.Подходят.Добавить(Выборка.ОР);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрРезультат;
КонецФункции

// Проверяет наличие оборудования на функциональных местах
Процедура торо_ПроверкаОборудованияНаФункциональныхМестах() Экспорт
	Если Константы.торо_ИспользоватьФункциональныеМеста.Получить() = Ложь Тогда 
		Возврат;
	КонецЕсли;
	СобытиеФМ = Константы.торо_ПараметрыОповещенияОПроверкеОборудованияНаФМ.Получить();
	Если ЗначениеЗаполнено(СобытиеФМ) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыДляПроверкиТребованийФМ.Объект КАК Ссылка,
		|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТипОбъекта 
		|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		|	ТИПЗНАЧЕНИЯ(торо_ОбъектыДляПроверкиТребованийФМ.Объект.Ссылка) = ТИП(Справочник.торо_ОбъектыРемонта) КАК ЭтоОР,
		|	торо_ОбъектыДляПроверкиТребованийФМ.Объект.ТиповойОР КАК ТОР
		|ПОМЕСТИТЬ ЭтиНужноПроверить1
		|ИЗ
		|	РегистрСведений.торо_ОбъектыДляПроверкиТребованийФМ КАК торо_ОбъектыДляПроверкиТребованийФМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта КАК ОР,
		|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТиповойОР КАК ТОР,
		|	торо_УчетКонтролируемыхПоказателейПоказатели.ОбъектРемонта.ТипОбъекта 
		|	= ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто) КАК ЭтоФМ,
		|	ИСТИНА КАК ЭтоОР,
		|	торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент КАК Док
		|ПОМЕСТИТЬ ЭтиНужноПроверить2
		|ИЗ
		|	РегистрСведений.торо_ДокументыДляПроверкиТребованийФМ КАК торо_ДокументыДляПроверкиТребованийФМ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_УчетКонтролируемыхПоказателей.Показатели 
		|	КАК торо_УчетКонтролируемыхПоказателейПоказатели
		|		ПО торо_ДокументыДляПроверкиТребованийФМ.ПроверяемыйДокумент = торо_УчетКонтролируемыхПоказателейПоказатели.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
		|	ЭтиНужноПроверить.ЭтоФМ КАК ЭтоФМ,
		|	ЭтиНужноПроверить.ЭтоОР КАК ЭтоОР,
		|	ЭтиНужноПроверить.ТОР КАК ТОР,
		|	NULL КАК ОР
		|ПОМЕСТИТЬ ЭтиНужноПроверить
		|ИЗ
		|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ЭтиНужноПроверить2.ЭтоФМ,
		|	ЭтиНужноПроверить2.ЭтоОР,
		|	ЭтиНужноПроверить2.ТОР,
		|	ЭтиНужноПроверить2.ОР
		|ИЗ
		|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК Ссылка,
		|	NULL КАК ОР
		|ПОМЕСТИТЬ ТолькоОР
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка,
		|	NULL
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК ФМ,
		|	ЭтиНужноПроверить.ТОР КАК ТОР,
		|	ИСТИНА КАК ПроверитьВсе
		|ПОМЕСТИТЬ ВсеФМ
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
		|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка,
		|	торо_ОбъектыРемонта.ТиповойОР,
		|	ИСТИНА
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоФМ = ИСТИНА
		|	И ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрОР.РодительИерархии,
		|	РегистрОР.РодительИерархии.ТиповойОР,
		|	ЛОЖЬ
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
		|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
		|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрОР.РодительИерархии,
		|	РегистрОР.РодительИерархии.ТиповойОР,
		|	ЛОЖЬ
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
		|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
		|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрОР.РодительИерархии,
		|	РегистрОР.РодительИерархии.ТиповойОР,
		|	ЛОЖЬ
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
		|		ПО ЭтиНужноПроверить.Ссылка = РегистрОР.ОбъектИерархии
		|			И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоОР = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрОР.РодительИерархии,
		|	РегистрОР.РодительИерархии.ТиповойОР,
		|	ЛОЖЬ
		|ИЗ
		|	ЭтиНужноПроверить КАК ЭтиНужноПроверить
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
		|			ПО торо_ОбъектыРемонта.Ссылка = РегистрОР.ОбъектИерархии
		|				И (РегистрОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто))
		|		ПО ЭтиНужноПроверить.Ссылка = торо_ОбъектыРемонта.ТиповойОР
		|ГДЕ
		|	ЭтиНужноПроверить.ЭтоОР = ЛОЖЬ
		|	И ЭтиНужноПроверить.ЭтоФМ = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеФМ.ФМ КАК ФМ,
		|	ВсеФМ.ТОР КАК ТОР,
		|	МАКСИМУМ(ВсеФМ.ПроверитьВсе) КАК ПроверитьВсе
		|ПОМЕСТИТЬ ФМТОР
		|ИЗ
		|	ВсеФМ КАК ВсеФМ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеФМ.ФМ,
		|	ВсеФМ.ТОР
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
		|	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия,
		|	ФМТОР.ФМ КАК ФМ,
		|	ЛОЖЬ КАК гкс_Удален
		|ПОМЕСТИТЬ ВсеОграничения
		|ИЗ
		|	ФМТОР КАК ФМТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования 
		|	КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
		|		ПО ФМТОР.ТОР = торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОграниченияНаХарактеристикиОборудования.Ограничение,
		|	торо_ОграниченияНаХарактеристикиОборудования.Иерархия,
		|	ФМТОР.ФМ,
		|	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален
		|ИЗ
		|	ФМТОР КАК ФМТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
		|		ПО ФМТОР.ФМ = торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеОграничения.Ограничение КАК Ограничение,
		|	ВсеОграничения.Иерархия КАК Иерархия,
		|	ВсеОграничения.ФМ КАК ФМ,
		|	МАКСИМУМ(ВсеОграничения.гкс_Удален) КАК гкс_Удален
		|ПОМЕСТИТЬ СхлопнутыеОграничения
		|ИЗ
		|	ВсеОграничения КАК ВсеОграничения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеОграничения.Ограничение,
		|	ВсеОграничения.Иерархия,
		|	ВсеОграничения.ФМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрОР.ОбъектИерархии КАК ОР,
		|	РегистрОР.СтруктураИерархии КАК СтруктураИерархии,
		|	РегистрОР.ОбъектИерархии.ТиповойОР КАК ТОР
		|ПОМЕСТИТЬ ВсеОР
		|ИЗ
		|	ФМТОР КАК ФМТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
		|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
		|			И (ФМТОР.ПроверитьВсе
		|				ИЛИ РегистрОР.ОбъектИерархии В
		|					(ВЫБРАТЬ
		|						ТЧ.Ссылка
		|					ИЗ
		|						ТолькоОР КАК ТЧ))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РегистрОР.ОбъектИерархии,
		|	РегистрОР.СтруктураИерархии,
		|	РегистрОР.ОбъектИерархии.ТиповойОР
		|ИЗ
		|	ФМТОР КАК ФМТОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних КАК РегистрОР
		|		ПО ФМТОР.ФМ = РегистрОР.РодительИерархии
		|			И (РегистрОР.Удален = ЛОЖЬ)
		|			И (ФМТОР.ПроверитьВсе
		|				ИЛИ РегистрОР.ОбъектИерархии В
		|					(ВЫБРАТЬ
		|						ТЧ.Ссылка
		|					ИЗ
		|						ТолькоОР КАК ТЧ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СхлопнутыеОграничения.Ограничение КАК Ограничение,
		|	ВсеОР.СтруктураИерархии КАК СтруктураИерархии,
		|	ВсеОР.ОР КАК ОР,
		|	СхлопнутыеОграничения.ФМ КАК ФМ
		|ПОМЕСТИТЬ ОграниченияОР
		|ИЗ
		|	СхлопнутыеОграничения КАК СхлопнутыеОграничения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОР КАК ВсеОР
		|		ПО (СхлопнутыеОграничения.Иерархия = ВсеОР.СтруктураИерархии
		|				ИЛИ СхлопнутыеОграничения.Иерархия = ЗНАЧЕНИЕ(Справочник.торо_СтруктурыОР.ПустаяСсылка))
		|			И (СхлопнутыеОграничения.гкс_Удален = ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
		|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Показатель КАК Показатель,
		|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Значение КАК Значение,
		|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ДатаКонтроля КАК ДатаКонтроля
		|ПОМЕСТИТЬ ПоказателиОР
		|ИЗ
		|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(
		|			,
		|			ОбъектРемонта В
		|				(ВЫБРАТЬ
		|					ТЧ.ОР
		|				ИЗ
		|					ВсеОР КАК ТЧ)) КАК торо_ЗначенияКонтролируемыхПоказателейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ПоказателиОР.Показатель КАК Показатель,
		|	МАКСИМУМ(ПоказателиОР.ДатаКонтроля) КАК ДатаКонтроля
		|ПОМЕСТИТЬ ПоказателиОРМаксимум
		|ИЗ
		|	ПоказателиОР КАК ПоказателиОР
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиОР.ОбъектРемонта,
		|	ПоказателиОР.Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
		|	ПоказателиОР.Показатель КАК Показатель,
		|	ПоказателиОР.Значение КАК Значение
		|ПОМЕСТИТЬ ПоказателиОРСрез
		|ИЗ
		|	ПоказателиОР КАК ПоказателиОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРМаксимум КАК ПоказателиОРМаксимум
		|		ПО ПоказателиОР.ОбъектРемонта = ПоказателиОРМаксимум.ОбъектРемонта
		|			И ПоказателиОР.Показатель = ПоказателиОРМаксимум.Показатель
		|			И ПоказателиОР.ДатаКонтроля = ПоказателиОРМаксимум.ДатаКонтроля
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеОР.ТОР КАК ТОР,
		|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
		|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение,
		|	ВсеОР.ОР КАК ОР
		|ПОМЕСТИТЬ РеквизитыТОР
		|ИЗ
		|	ВсеОР КАК ВсеОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
		|		ПО ВсеОР.ТОР = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение,
		|	ОграниченияОР.ОР КАК ОР,
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика,
		|	ОграниченияОР.ФМ КАК ФМ
		|ПОМЕСТИТЬ ОграниченияРеквизиты
		|ИЗ
		|	ОграниченияОР КАК ОграниченияОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
		|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОграниченияОР.ОР КАК ОР,
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика КАК Характеристика,
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения КАК ВидСравнения,
		|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение КАК Значение,
		|	ОграниченияОР.ФМ КАК ФМ
		|ПОМЕСТИТЬ ОграниченияПоказатели
		|ИЗ
		|	ОграниченияОР КАК ОграниченияОР
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
		|		ПО ОграниченияОР.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
		|	ОграниченияРеквизиты.Значение КАК План,
		|	ОграниченияРеквизиты.ОР КАК ОР,
		|	РеквизитыТОР.Значение КАК Факт,
		|	РеквизитыТОР.Свойство КАК Свойство,
		|	ОграниченияРеквизиты.ФМ КАК ФМ,
		|	ОграниченияРеквизиты.ФМ.Подразделение КАК Подразделение
		|ИЗ
		|	ОграниченияРеквизиты КАК ОграниченияРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыТОР КАК РеквизитыТОР
		|		ПО ОграниченияРеквизиты.ОР = РеквизитыТОР.ОР
		|			И ОграниченияРеквизиты.Характеристика = РеквизитыТОР.Свойство
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОграниченияПоказатели.ВидСравнения,
		|	ОграниченияПоказатели.Значение,
		|	ОграниченияПоказатели.ОР,
		|	ПоказателиОР.Значение,
		|	ПоказателиОР.Показатель,
		|	ОграниченияПоказатели.ФМ,
		|	ОграниченияПоказатели.ФМ.Подразделение
		|ИЗ
		|	ОграниченияПоказатели КАК ОграниченияПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРСрез КАК ПоказателиОР
		|		ПО ОграниченияПоказатели.Характеристика = ПоказателиОР.Показатель
		|			И ОграниченияПоказатели.ОР = ПоказателиОР.ОбъектРемонта
		|ИТОГИ
		|	МАКСИМУМ(ФМ)
		|ПО
		|	ОР";
	МВТ = Новый МенеджерВременныхТаблиц();
	Результат = ПроверитьОграниченияМассиваОР(,, ЗапросТекст, МВТ);
	
	Если Не Результат = Неопределено Тогда 
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = МВТ;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтиНужноПроверить.Ссылка КАК Ссылка
		|ИЗ
		|	ЭтиНужноПроверить1 КАК ЭтиНужноПроверить
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭтиНужноПроверить.Док КАК Док
		|ИЗ
		|	ЭтиНужноПроверить2 КАК ЭтиНужноПроверить";
		 РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Отбор.Объект.Установить(Выборка.Ссылка);
			НаборЗаписейРегистраторо_ОбъектыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;
		
		Выборка = РезультатЗапроса[1].Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ = 
				РегистрыСведений.торо_ДокументыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Отбор.ПроверяемыйДокумент.Установить(Выборка.Док);
			НаборЗаписейРегистраторо_ДокументыДляПроверкиТребованийФМ.Записать();
		КонецЦикла;

		//
		Для Каждого СтрокаМассиваНеподходящихОбъектовРемонта Из Результат.НеПодходят Цикл
			СтруктураДанных = Новый Структура("Ссылка,ОбъектРемонта,ТекстТребований,ФМ,ВидДокумента");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаМассиваНеподходящихОбъектовРемонта);
			СтруктураДанных.ОбъектРемонта = СтрокаМассиваНеподходящихОбъектовРемонта.Ссылка;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Находит функциональное место для объекта ремонта
//
// Параметры:
//  Ссылка - СправочникСсылка.торо_ОбъектыРемонта
Функция НайтиФМ(Ссылка) Экспорт
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат Неопределено;
	КонецЕсли;
	ПоследняяСсылка = Ссылка;
	Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
	Запрос = Новый Запрос;
	Пока ЗначениеЗаполнено(ПоследняяСсылка) Цикл
		Если Иерархия.ИзменяетсяДокументами = истина Тогда 
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	1 КАК Приоритет
				|ПОМЕСТИТЬ Уровень1
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии = &Ссылка
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	2 КАК Приоритет
				|ПОМЕСТИТЬ Уровень2
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии В
				|					(ВЫБРАТЬ
				|						ТЧ.РодительИерархии
				|					ИЗ
				|						Уровень1 КАК ТЧ)
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	3 КАК Приоритет
				|ПОМЕСТИТЬ Уровень3
				|ИЗ
				|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
				|			,
				|			ОбъектИерархии В
				|					(ВЫБРАТЬ
				|						ТЧ.РодительИерархии
				|					ИЗ
				|						Уровень2 КАК ТЧ)
				|				И СтруктураИерархии = &Иерархия) КАК РегистрОР";
		Иначе
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	1 КАК Приоритет
				|ПОМЕСТИТЬ Уровень1
				|ИЗ
				|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|ГДЕ
				|	РегистрОР.ОбъектИерархии = &Ссылка
				|	И РегистрОР.СтруктураИерархии = &Иерархия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	2 КАК Приоритет
				|ПОМЕСТИТЬ Уровень2
				|ИЗ
				|	Уровень1 КАК Уровень1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|		ПО Уровень1.РодительИерархии = РегистрОР.ОбъектИерархии
				|			И (РегистрОР.СтруктураИерархии = &Иерархия)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрОР.РодительИерархии КАК РодительИерархии,
				|	РегистрОР.РодительИерархии.ТипОбъекта = &ТипФМ КАК ТипОбъекта,
				|	3 КАК Приоритет
				|ПОМЕСТИТЬ Уровень3
				|ИЗ
				|	Уровень2 КАК Уровень1
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
				|		ПО Уровень1.РодительИерархии = РегистрОР.ОбъектИерархии
				|			И (РегистрОР.СтруктураИерархии = &Иерархия)";
		КонецЕсли;
		//
		Запрос.Текст = Запрос.Текст + "
		| ;  "+"ВЫБРАТЬ
		       |	Уровень1.РодительИерархии КАК РодительИерархии,
		       |	Уровень1.ТипОбъекта КАК ТипОбъекта,
		       |	Уровень1.Приоритет КАК Приоритет
		       |ПОМЕСТИТЬ ВсеРодители
		       |ИЗ
		       |	Уровень1 КАК Уровень1
		       |
		       |ОБЪЕДИНИТЬ ВСЕ
		       |
		       |ВЫБРАТЬ
		       |	Уровень2.РодительИерархии,
		       |	Уровень2.ТипОбъекта,
		       |	Уровень2.Приоритет
		       |ИЗ
		       |	Уровень2 КАК Уровень2
		       |
		       |ОБЪЕДИНИТЬ ВСЕ
		       |
		       |ВЫБРАТЬ
		       |	Уровень3.РодительИерархии,
		       |	Уровень3.ТипОбъекта,
		       |	Уровень3.Приоритет
		       |ИЗ
		       |	Уровень3 КАК Уровень3
		       |;
		       |
		       |////////////////////////////////////////////////////////////////////////////////
		       |ВЫБРАТЬ
		       |	ВсеРодители.РодительИерархии КАК РодительИерархии,
		       |	ЕстьNull(ВсеРодители.ТипОбъекта,Ложь) КАК ТипОбъекта,
		       |	ВсеРодители.Приоритет КАК Приоритет
		       |ИЗ
		       |	ВсеРодители КАК ВсеРодители
		       |
		       |УПОРЯДОЧИТЬ ПО
		       |	Приоритет";
		//
		Запрос.УстановитьПараметр("Иерархия", Иерархия);
		Запрос.УстановитьПараметр("Ссылка", ПоследняяСсылка);
		Запрос.УстановитьПараметр("ТипФМ", Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		ПоследняяСсылка = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.РодительИерархии) Тогда 
				ПоследняяСсылка = Выборка.РодительИерархии;
				Если Выборка.ТипОбъекта Тогда 
					ПоследняяСсылка = Неопределено;
					Возврат Выборка.РодительИерархии;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

// Находит функциональное место для объекта ремонта
//
// Параметры:
//  Ссылка - СправочникСсылка.торо_ОбъектыРемонта
Функция НайтиТМ(Ссылка) Экспорт
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ТМ;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

// Проецирует техническое место Объекта ремонта на подчиненные Объекты ремонта
//
// Параметры:
//  Ссылка - СправочникСсылка.торо_ОбъектыРемонта
//  ИсточникПодчиненных - СправочникСсылка.торо_ОбъектыРемонта - Объект ремонта, подчиненные которого нужно обновить
Процедура ПроецироватьТКНаПодчиненных(Ссылка, ИсточникПодчиненных = Неопределено)Экспорт
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
		|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка
		|	И гкс_ТекущиеФМОР.ФМ = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекущееФункциональноеМесто = Выборка.ТМ;
		//
		Иерархия = Константы.торо_ИерархияДляВводаНовыхОР.Получить();
		ПоследняяСсылка = Новый Массив();
		Если ИсточникПодчиненных = Неопределено Тогда 
			ПоследняяСсылка.Добавить(Ссылка);
		Иначе
			ПоследняяСсылка.Добавить(ИсточникПодчиненных);
		КонецЕсли;
		Пока ПоследняяСсылка.Количество() Цикл
			Если Иерархия.ИзменяетсяДокументами = истина Тогда 
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	1 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень1
					|ИЗ
					|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &Иерархия) КАК РегистрОР
					|ГДЕ
					|	РегистрОР.РодительИерархии В(&Ссылка)
					|	И НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	2 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень2
					|ИЗ
					|	Уровень1 КАК Уровень1
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &Иерархия) КАК РегистрОР
					|		ПО Уровень1.ОбъектИерархии = РегистрОР.РодительИерархии
					|			И (НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	3 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень3
					|ИЗ
					|	Уровень2 КАК Уровень2
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &Иерархия) КАК РегистрОР
					|		ПО Уровень2.ОбъектИерархии = РегистрОР.РодительИерархии
					|			И (НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ)";
			Иначе
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	1 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень1
					|ИЗ
					|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
					|ГДЕ
					|	РегистрОР.РодительИерархии В(&Ссылка)
					|	И НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ
					|	И РегистрОР.СтруктураИерархии = &Иерархия
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	2 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень2
					|ИЗ
					|	Уровень1 КАК Уровень1
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
					|		ПО Уровень1.ОбъектИерархии = РегистрОР.РодительИерархии
					|			И (РегистрОР.СтруктураИерархии = &Иерархия)
					|			И (НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	3 КАК Приоритет,
					|	РегистрОР.ОбъектИерархии КАК ОбъектИерархии
					|ПОМЕСТИТЬ Уровень3
					|ИЗ
					|	Уровень2 КАК Уровень2
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ИерархическиеСтруктурыОР КАК РегистрОР
					|		ПО Уровень2.ОбъектИерархии = РегистрОР.РодительИерархии
					|			И (НЕ РегистрОР.ОбъектИерархии.ТипОбъекта = &ТипФМ)
					|			И (РегистрОР.СтруктураИерархии = &Иерархия)";
			КонецЕсли;
			//
			Запрос.Текст = Запрос.Текст + "
			| ;  "+"ВЫБРАТЬ
			       |	Уровень1.ОбъектИерархии КАК ОбъектИерархии,
			       |	Уровень1.Приоритет КАК Приоритет
			       |ПОМЕСТИТЬ ВсеРодители
			       |ИЗ
			       |	Уровень1 КАК Уровень1
			       |
			       |ОБЪЕДИНИТЬ ВСЕ
			       |
			       |ВЫБРАТЬ
			       |	Уровень2.ОбъектИерархии,
			       |	Уровень2.Приоритет
			       |ИЗ
			       |	Уровень2 КАК Уровень2
			       |
			       |ОБЪЕДИНИТЬ ВСЕ
			       |
			       |ВЫБРАТЬ
			       |	Уровень3.ОбъектИерархии,
			       |	Уровень3.Приоритет
			       |ИЗ
			       |	Уровень3 КАК Уровень3
			       |;
			       |
			       |////////////////////////////////////////////////////////////////////////////////
			       |ВЫБРАТЬ
			       |	ВсеРодители.ОбъектИерархии КАК ОР,
				   |	ВсеРодители.ОбъектИерархии.ЭтоГруппа КАК ЭтоГруппа,
			       |	ВсеРодители.Приоритет КАК Приоритет
			       |ИЗ
			       |	ВсеРодители КАК ВсеРодители
			       |
			       |УПОРЯДОЧИТЬ ПО
			       |	Приоритет";
			//
			Запрос.УстановитьПараметр("Иерархия", Иерархия);
			Запрос.УстановитьПараметр("Ссылка", ПоследняяСсылка);
			Запрос.УстановитьПараметр("ТипФМ", Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			ПоследняяСсылка = Новый Массив();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоГруппа = Ложь Тогда 
					УстановитьТКФМ(Выборка.ОР,Ссылка,ТекущееФункциональноеМесто);
				КонецЕсли;
				Если Выборка.Приоритет = 3 Тогда 
					ПоследняяСсылка.Добавить(Выборка.ОР);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьТКФМ(Ссылка, ФункциональноеМесто, ТехническоеМестоФункциональногоМеста)
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
		|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
		НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
		НоваяСтрокаНабораЗаписей.ОР = Ссылка;
		НоваяСтрокаНабораЗаписей.ФМ = ФункциональноеМесто;
		НоваяСтрокаНабораЗаписей.ТМ = Неопределено;
		НоваяСтрокаНабораЗаписей.ТМФМ = ТехническоеМестоФункциональногоМеста;
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		//
		НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
		НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
		НоваяСтрокаНабораЗаписей.ОР = Ссылка;
		НоваяСтрокаНабораЗаписей.ФМ = ФункциональноеМесто;
		НоваяСтрокаНабораЗаписей.ТМ = Выборка.ТМ;
		НоваяСтрокаНабораЗаписей.ТМФМ = ТехническоеМестоФункциональногоМеста;
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
	КонецЕсли;
КонецПроцедуры

// Обновляет запись в регистре текущих функциональных мест для Объекта ремонта
//
// Параметры:
//  Ссылка - СправочникСсылка.торо_ОбъектыРемонта
//  ЭтоФункциональноеМесто - Булево - Обновляется функциональное место
Процедура ОбновитьТекущийФМОР(Ссылка, ЭтоФункциональноеМесто)Экспорт
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гкс_ТекущиеФМОР.ФМ КАК ФМ,
		|	гкс_ТекущиеФМОР.ТМ КАК ТМ,
		|	гкс_ТекущиеФМОР.ТМФМ КАК ТМФМ
		|ИЗ
		|	РегистрСведений.гкс_ТекущиеФМОР КАК гкс_ТекущиеФМОР
		|ГДЕ
		|	гкс_ТекущиеФМОР.ОР = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() = Ложь Тогда
		НужноПроецировать = Ложь; ТекущееФункциональноеМесто = Неопределено;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
		НоваяСтрокаНабораЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
		НоваяСтрокаНабораЗаписей.ОР = Ссылка;
		Если ЭтоФункциональноеМесто Тогда 
			НоваяСтрокаНабораЗаписей.ФМ = Ссылка;
			ТекущееФункциональноеМесто = Ссылка;
			Если Не Выборка.ФМ = Ссылка Тогда 
				НужноПроецировать = Истина;
			КонецЕсли;
		Иначе
			Если Выборка.ФМ = Ссылка Тогда 
				НоваяСтрокаНабораЗаписей.ФМ = НайтиФМ(Ссылка);
				ТекущееФункциональноеМесто = НоваяСтрокаНабораЗаписей.ФМ;
				НоваяСтрокаНабораЗаписей.ТМФМ = НайтиТМ(ТекущееФункциональноеМесто);
				НужноПроецировать = Истина;
			Иначе
				НоваяСтрокаНабораЗаписей.ФМ = Выборка.ФМ;
				НоваяСтрокаНабораЗаписей.ТМФМ = Выборка.ТМФМ;
			КонецЕсли;
			
		КонецЕсли;
		НоваяСтрокаНабораЗаписей.ТМ = Выборка.ТМ;
		
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
		Если НужноПроецировать Тогда 
			ПроецироватьТКНаПодчиненных(ТекущееФункциональноеМесто, Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Обновляет запись в регистре текущих функциональных мест для Объекта ремонта
//
// Параметры:
//  Ссылка - СправочникСсылка.торо_ОбъектыРемонта
Процедура ОбновитьТекущийОР(Ссылка)Экспорт
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат;
	ИначеЕсли СтрНайти(Строка(Ссылка),"<Объект не найден>") > 0 Тогда 
		Возврат;
	КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка
		|	И торо_ОбъектыРемонта.ТипОбъекта = &ТипФМ";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипФМ", Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой()Тогда
		ТекущееФункциональноеМесто = НайтиФМ(Ссылка);
		
		НаборЗаписейРегистрагкс_ТекущиеФМОР = РегистрыСведений.гкс_ТекущиеФМОР.СоздатьНаборЗаписей();
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Отбор.ОР.Установить(Ссылка);
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Прочитать();
		Если НаборЗаписейРегистрагкс_ТекущиеФМОР.Количество() Тогда 
			ИндексПервойЗаписиНабораЗаписей = 0;
			НоваяСтрокаНаборЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР[ИндексПервойЗаписиНабораЗаписей];
			Если НоваяСтрокаНаборЗаписей.ФМ = ТекущееФункциональноеМесто Тогда 
				Возврат;
			КонецЕсли;
		Иначе
			НоваяСтрокаНаборЗаписей = НаборЗаписейРегистрагкс_ТекущиеФМОР.Добавить();
			НоваяСтрокаНаборЗаписей.ОР = Ссылка;
			НоваяСтрокаНаборЗаписей.ТМ = Неопределено;
		КонецЕсли;
		НоваяСтрокаНаборЗаписей.ФМ = ТекущееФункциональноеМесто;
		ТехническоеМестоФункциональногоМеста = НайтиТМ(ТекущееФункциональноеМесто);
		НоваяСтрокаНаборЗаписей.ТМФМ = ТехническоеМестоФункциональногоМеста;
		НаборЗаписейРегистрагкс_ТекущиеФМОР.Записать();
		//
		ПроецироватьТКНаПодчиненных(ТекущееФункциональноеМесто, Ссылка);
	КонецЕсли;
КонецПроцедуры
